InformationRegisters/Расписание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Расписание</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерПары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Группы</Name>
					<Comment>Перечисление групп на паре</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Семестр</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Семестр</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДеньНедели</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДеньНедели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗанятия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидЗанятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аудитория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Аудитория</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Преподаватель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Преподаватель</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дисциплина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Дисциплина</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Расписание/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьКолвоСтудентов(НазваниеГруппы) 
	Возврат Справочники
				.Группа
				.НайтиПоНаименованию(НазваниеГруппы)
				.КоличествоСтудентов;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСсылкуНаГруппу(НазваниеГруппы)  
	Возврат Справочники
				.Группа 
				.НайтиПоНаименованию(НазваниеГруппы)
				.Ссылка;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКолвоМестАудитории(Аудитория)
	Возврат Справочники
				.Аудитория
				.НайтиПоНаименованию(Аудитория)
				.Места;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьМаксимальныйКодРасписания() 
	
	Запрос = Новый Запрос("
	|Выбрать
	|	МАКСИМУМ(Код) КАК Код
	|ИЗ
	|	РегистрСведений.Расписание"
	);     
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат[0].Код;
КонецФункции

&НаКлиенте
Процедура АудиторияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	АудВместимость = ПолучитьКолвоМестАудитории(ВыбранноеЗначение);
	Если ВсегоСтудентов > АудВместимость Тогда 
		Элементы.ВсегоСтудентов.ЦветТекста = Новый Цвет(255, 0, 0);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ТЧГруппыПриИзменении(Элемент)	
	ВсегоСтудентов = ТЧГруппы.Итог("КСтудентов");
	
	Если ВсегоСтудентов > АудВместимость Тогда 
		Элементы.ВсегоСтудентов.ЦветТекста = Новый Цвет(255, 0, 0);
	КонецЕсли;    
КонецПроцедуры  

&НаКлиенте
Процедура ТЧГруппыГруппаПриИзменении(Элемент)   
	Группа = Элементы.ТЧГруппы.ТекущиеДанные.Группа; 
	Студенты = ПолучитьКолвоСтудентов(Группа);
	Элементы.ТЧГруппы.ТекущиеДанные.КСтудентов = Студенты; 	
КонецПроцедуры    

&НаКлиенте
Процедура ТЧГруппыГруппаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	Для каждого Строка из ТЧГруппы Цикл
		Если Строка.Группа = ВыбранноеЗначение Тогда
			Предупреждение("Данная группа уже есть в списке!");
			СтандартнаяОбработка = ложь;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте  
Функция СформироватьСтрокуГрупп()
	Группы = "";
	Для каждого Строка из ТЧГруппы Цикл
		Группы = Строка(Группы) + " " + Строка.Группа;
	КонецЦикла; 
	Возврат Группы;
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Запись.Группы = СформироватьСтрокуГрупп();
	Если не ЗначениеЗаполнено(Запись.Код) Тогда
		Значение = ПолучитьМаксимальныйКодРасписания() + 1;
		Запись.Код = Значение; 
	КонецЕсли; 
	
	Если ВсегоСтудентов > АудВместимость Тогда
		ТекстВопроса = "Все студенты выбранных групп не поместятся в этой аудитории. Продолжить?";
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Отказ = Истина;
		КонецЕсли; 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 	
	МассивГрупп = СтрРазделить(Запись.Группы, " ", Ложь);
	Если МассивГрупп.Количество() <> 0 Тогда
		Для каждого Значение из МассивГрупп Цикл
			СтрокаГруппа = ТЧГруппы.Добавить();
			СтрокаГруппа.Группа = ПолучитьСсылкуНаГруппу(Значение);
			СтрокаГруппа.КСтудентов = ПолучитьКолвоСтудентов(Значение);
		КонецЦикла;
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(АудВместимость) Тогда
		АудВместимость = ПолучитьКолвоМестАудитории(Запись.Аудитория); 
	КонецЕсли;
	
	ВсегоСтудентов = ТЧГруппы.Итог("КСтудентов");
	
КонецПроцедуры    

&НаКлиенте
Процедура ВсегоСтудентовПриИзменении(Элемент)
КонецПроцедуры
